kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_0/ESP32-S3-Station-V_7_7_0.ino
void drawHoldProgressHUD(unsigned long holdDur) {
  int boxX = 6, boxY = 100, boxW = 160, boxH = 100;
  tft.fillRoundRect(boxX, boxY, boxW, boxH, 8, THEME_NAVY);
  tft.drawRoundRect(boxX, boxY, boxW, boxH, 8, THEME_CYAN);

  int barX = boxX + 15;
  int barY = boxY + 48;
  int barW = 130;
  int barH = 12;

  if (holdDur < 3000) {
    int fill = map(holdDur, 400, 3000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("BUTTON HOLDING", boxY + 12, 1, THEME_SKYBLUE, THEME_NAVY);
    drawCenteredString("-> SENSOR CHECK (3s)", boxY + 28, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_PINK);
    drawCenteredString("Release <3s = Cancel", boxY + 82, 1, ST77XX_LIGHTGREY, THEME_NAVY);
  }
  else if (holdDur < 5000) {
    int fill = map(holdDur, 3000, 5000, 0, barW);
    if (fill < 0) fill = 0;
    if (fill > barW) fill = barW;

    drawCenteredString("RELEASE = CHECK", boxY + 12, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("-> CREDITS (5s)", boxY + 28, 1, THEME_PINK, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, fill, barH - 2, THEME_CYAN);
  }
  else {
    drawCenteredString(">> CREDITS READY <<", boxY + 14, 1, COLOR_GREEN, THEME_NAVY);
    drawCenteredString("RELEASE TO VIEW", boxY + 30, 1, COLOR_YELLOW, THEME_NAVY);
    tft.drawRect(barX, barY, barW, barH, COLOR_WHITE);
    tft.fillRect(barX + 1, barY + 1, barW - 2, barH - 2, COLOR_GREEN);
  }
}

// ============================================================================
// เชื่อมตัวตรวจจับหยด (drop_detector.h) เข้ากับส่วนอื่นของเฟิร์มแวร์
// ตัวอัลกอริทึมทั้งหมดอยู่ในไฟล์นั้น ไฟล์นี้ทำแค่ป้อนค่า ADC เข้าไปและรับผลออกมา
// ============================================================================
iv::DropDetector detector;

int  sensorRaw      = 0;     // ค่าดิบล่าสุด (ไว้แสดงผล)
bool sensorHasDrops = false; // เคยจับหยดได้แล้วอย่างน้อย 1 หยด

// นำผลของหยด 1 หยดไปคำนวณอัตราไหล/ปริมาตร (ตรรกะเดิมทุกประการ)
void onDropDetected() {
  unsigned long now = millis();
  totalDrops++;
  periodDropsCounter++;
  sensorHasDrops = true;

  isDropFalling = true;
  dropFallStartTime = now;
  animDropY = CHAMBER_NOZZLE_Y;

  uint8_t df = safeDropFactor(dropFactor);
  if (hasFirstDropOccurred && !skipNextInterval) {
    unsigned long dropDeltaMs = now - lastDropTimestamp;
    if (dropDeltaMs > minDropInterval && dropDeltaMs < MAX_OCCLUSION_MS) {
      float instantGttMin   = 60000.0f / (float)dropDeltaMs;
      float instantRateMlHr = (instantGttMin * 60.0f) / (float)df;
      if (currentFlowRate_ml_hr == 0.0f) currentFlowRate_ml_hr = instantRateMlHr;
      else currentFlowRate_ml_hr = (instantRateMlHr * 0.75f) + (currentFlowRate_ml_hr * 0.25f);
    }
  }
  hasFirstDropOccurred = true;
  skipNextInterval = false;
  lastDropTimestamp = now;
  currentGttMin = (currentFlowRate_ml_hr * (float)df) / 60.0f;
  totalVolumeMl = (float)totalDrops / (float)df;
}

// เรียกให้ถี่ที่สุดเท่าที่ทำได้ — countDrops = false ตอนหยุดชั่วคราวหรืออยู่หน้าตรวจเซนเซอร์
bool serviceDropSensor(bool countDrops) {
  sensorRaw = analogRead(SENSOR_AO_PIN);
  bool got = detector.update(sensorRaw, micros());
  if (got && countDrops) onDropDetected();
  return got;
}

const iv::DetectorStatus &det() { return detector.status(); }

// ข้อความสถานะที่พยาบาลอ่านแล้วรู้ว่าต้องทำอะไรต่อ — มีแค่ 4 แบบเท่านั้น
const char* sensorStateWord() {
  switch (det().lock) {
    case iv::Lock::Ready:    return "READY";
    case iv::Lock::Learning: return "LEARNING";
    case iv::Lock::NoDrops:  return "CHECK SENSOR";
    default:                 return "STARTING";
  }
}

uint16_t sensorStateColor() {
  switch (det().lock) {
    case iv::Lock::Ready:    return UI_GREEN;
    case iv::Lock::Learning: return COLOR_YELLOW;
    case iv::Lock::NoDrops:  return COLOR_RED;
    default:                 return THEME_SKYBLUE;
  }
}

// บันทึก/อ่านสิ่งที่เครื่องเรียนรู้ไว้ เพื่อให้เปิดเครื่องครั้งถัดไปพร้อมใช้เร็วขึ้น
void saveLearning() {
  stationPrefs.begin("st_cal", false);
  stationPrefs.putInt("lamp", det().learnedAmp);
  stationPrefs.putInt("lwid", det().learnedWidthMs);
  stationPrefs.putInt("pol",  detector.polarity());
  stationPrefs.end();
}

void loadLearning() {
  stationPrefs.begin("st_cal", true);
  int amp = stationPrefs.getInt("lamp", 0);
  int wid = stationPrefs.getInt("lwid", 0);
  int pol = stationPrefs.getInt("pol", 0);
  stationPrefs.end();
  if (pol == 1 || pol == -1) detector.setPolarity((int8_t)pol);
  else                       detector.setPolarityAuto();
  detector.seedLearning(amp, wid);
}

// ============================================================================
// หน้าตรวจเซนเซอร์ (กดปุ่มค้าง 3 วินาที) — ใช้ตอนติดตั้งหรือเวลาสงสัยว่าผิดปกติ
// ไม่มีขั้นตอนให้ทำตาม ไม่ต้องหยุดน้ำ ไม่ต้องกดยืนยันอะไร ดูอย่างเดียวแล้วกดออก
// ============================================================================
#define SCOPE_X            7
#define SCOPE_W            158
#define SCOPE_H            72
#define SCOPE_MS_PER_COL   16
#define SCOPE_TOP          64

int16_t scopeCol[SCOPE_W];
uint8_t scopeHead = 0;
int scopeColMax = 0;
int scopeFull = 200;
unsigned long scopeColStart = 0;

void scopeReset() {
  for (int i = 0; i < SCOPE_W; i++) scopeCol[i] = 0;
  scopeHead = 0; scopeColMax = 0; scopeColStart = millis();
}

void scopePush(int v) {
  if (v < 0) v = 0;
  if (v > scopeColMax) scopeColMax = v;
  unsigned long now = millis();
  if (now - scopeColStart < SCOPE_MS_PER_COL) return;
  scopeColStart = now;
  scopeCol[scopeHead] = (int16_t)scopeColMax;
  scopeHead = (uint8_t)((scopeHead + 1) % SCOPE_W);
  scopeColMax = v;
}

int scopeYof(int y, int value) {
  if (scopeFull < 20) scopeFull = 20;
  long h = (long)value * (SCOPE_H - 1) / scopeFull;
  if (h < 0) h = 0;
  if (h > SCOPE_H - 1) h = SCOPE_H - 1;
  return y + SCOPE_H - 1 - (int)h;
}

void scopeDraw(int y) {
  int thr = det().threshold;
  int peak = thr * 2;
  for (int i = 0; i < SCOPE_W; i++) if (scopeCol[i] > peak) peak = scopeCol[i];
  scopeFull = (peak * 12) / 10;
  if (scopeFull < 40) scopeFull = 40;
  int yThr = scopeYof(y, thr);

  for (int i = 0; i < SCOPE_W; i++) {
    // การวาดทั้งแถบใช้เวลาหลายสิบมิลลิวินาทีบนจอจริง ต้องแทรกการอ่านเซนเซอร์ไว้ด้วย
    // ไม่งั้นการวาดจอจะทำให้การอ่านขาดช่วงจนตรวจจับหยดไม่ได้
    if ((i % 12) == 0) serviceDropSensor(false);
    int x = SCOPE_X + i;
    int v = scopeCol[(scopeHead + i) % SCOPE_W];
    int yTop = scopeYof(y, v);
    if (yTop > y) tft.drawFastVLine(x, y, yTop - y, THEME_BG);
    if (yTop < y + SCOPE_H)
      tft.drawFastVLine(x, yTop, y + SCOPE_H - yTop,
                        (v >= thr) ? COLOR_YELLOW : THEME_SKYBLUE);
    if ((i % 4) < 2 && thr < scopeFull && yThr < yTop) tft.drawPixel(x, yThr, COLOR_ORANGE);
  }
}

